Repository: devgateway/standard
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/merging.po
Languages: es

source: Merging
es: Ḿḗřɠīƞɠ

source: In OCDS, merging involves combining individual [releases](../getting_started/releases_and_records.md) of data during a contracting process into a [record](../getting_started/releases_and_records.md) which provides an at-a-glance view of the current state and history of that process.
es: Īƞ ǾƇḒŞ, ḿḗřɠīƞɠ īƞṽǿŀṽḗş ƈǿḿƀīƞīƞɠ īƞḓīṽīḓŭȧŀ [řḗŀḗȧşḗş](../getting_started/releases_and_records.md) ǿƒ ḓȧŧȧ ḓŭřīƞɠ ȧ ƈǿƞŧřȧƈŧīƞɠ ƥřǿƈḗşş īƞŧǿ ȧ [řḗƈǿřḓ](../getting_started/releases_and_records.md) ẇħīƈħ ƥřǿṽīḓḗş ȧƞ ȧŧ-ȧ-ɠŀȧƞƈḗ ṽīḗẇ ǿƒ ŧħḗ ƈŭřřḗƞŧ şŧȧŧḗ ȧƞḓ ħīşŧǿřẏ ǿƒ ŧħȧŧ ƥřǿƈḗşş.

source: A publisher provides a tender release on 1st January, with a planned contract value of $1000.
es: Ȧ ƥŭƀŀīşħḗř ƥřǿṽīḓḗş ȧ ŧḗƞḓḗř řḗŀḗȧşḗ ǿƞ 1şŧ Ĵȧƞŭȧřẏ, ẇīŧħ ȧ ƥŀȧƞƞḗḓ ƈǿƞŧřȧƈŧ ṽȧŀŭḗ ǿƒ $1000.

source: On 31st January, the publisher provides an amended tender release updating the planned contract value to $1500.
es: Ǿƞ 31şŧ Ĵȧƞŭȧřẏ, ŧħḗ ƥŭƀŀīşħḗř ƥřǿṽīḓḗş ȧƞ ȧḿḗƞḓḗḓ ŧḗƞḓḗř řḗŀḗȧşḗ ŭƥḓȧŧīƞɠ ŧħḗ ƥŀȧƞƞḗḓ ƈǿƞŧřȧƈŧ ṽȧŀŭḗ ŧǿ $1500.

source: After assessing bids, it is decided to award the contract in two lots.
es: Ȧƒŧḗř ȧşşḗşşīƞɠ ƀīḓş, īŧ īş ḓḗƈīḓḗḓ ŧǿ ȧẇȧřḓ ŧħḗ ƈǿƞŧřȧƈŧ īƞ ŧẇǿ ŀǿŧş.

source: On 1st March, the publisher provides an award release, announcing Company A have been awarded a contract for $750.
es: Ǿƞ 1şŧ Ḿȧřƈħ, ŧħḗ ƥŭƀŀīşħḗř ƥřǿṽīḓḗş ȧƞ ȧẇȧřḓ řḗŀḗȧşḗ, ȧƞƞǿŭƞƈīƞɠ Ƈǿḿƥȧƞẏ Ȧ ħȧṽḗ ƀḗḗƞ ȧẇȧřḓḗḓ ȧ ƈǿƞŧřȧƈŧ ƒǿř $750.

source: On 3rd March, the publisher provides an separate award release, announcing that company B have been awarded a contract for $750
es: Ǿƞ 3řḓ Ḿȧřƈħ, ŧħḗ ƥŭƀŀīşħḗř ƥřǿṽīḓḗş ȧƞ şḗƥȧřȧŧḗ ȧẇȧřḓ řḗŀḗȧşḗ, ȧƞƞǿŭƞƈīƞɠ ŧħȧŧ ƈǿḿƥȧƞẏ Ɓ ħȧṽḗ ƀḗḗƞ ȧẇȧřḓḗḓ ȧ ƈǿƞŧřȧƈŧ ƒǿř $750

source: These independent releases each provide real-time information about what is happening in the contracting process. The record will combine them together. Using the same schema and structure as the releases, the main body of the record will contain a tender with contract value of $1500, and details of both awards.
es: Ŧħḗşḗ īƞḓḗƥḗƞḓḗƞŧ řḗŀḗȧşḗş ḗȧƈħ ƥřǿṽīḓḗ řḗȧŀ-ŧīḿḗ īƞƒǿřḿȧŧīǿƞ ȧƀǿŭŧ ẇħȧŧ īş ħȧƥƥḗƞīƞɠ īƞ ŧħḗ ƈǿƞŧřȧƈŧīƞɠ ƥřǿƈḗşş. Ŧħḗ řḗƈǿřḓ ẇīŀŀ ƈǿḿƀīƞḗ ŧħḗḿ ŧǿɠḗŧħḗř. Ŭşīƞɠ ŧħḗ şȧḿḗ şƈħḗḿȧ ȧƞḓ şŧřŭƈŧŭřḗ ȧş ŧħḗ řḗŀḗȧşḗş, ŧħḗ ḿȧīƞ ƀǿḓẏ ǿƒ ŧħḗ řḗƈǿřḓ ẇīŀŀ ƈǿƞŧȧīƞ ȧ ŧḗƞḓḗř ẇīŧħ ƈǿƞŧřȧƈŧ ṽȧŀŭḗ ǿƒ $1500, ȧƞḓ ḓḗŧȧīŀş ǿƒ ƀǿŧħ ȧẇȧřḓş.

source: If the record is complete with versioning information, then the versioning section will reveal that the planned contract value changed from $1000 to $1500 on 31st January.
es: Īƒ ŧħḗ řḗƈǿřḓ īş ƈǿḿƥŀḗŧḗ ẇīŧħ ṽḗřşīǿƞīƞɠ īƞƒǿřḿȧŧīǿƞ, ŧħḗƞ ŧħḗ ṽḗřşīǿƞīƞɠ şḗƈŧīǿƞ ẇīŀŀ řḗṽḗȧŀ ŧħȧŧ ŧħḗ ƥŀȧƞƞḗḓ ƈǿƞŧřȧƈŧ ṽȧŀŭḗ ƈħȧƞɠḗḓ ƒřǿḿ $1000 ŧǿ $1500 ǿƞ 31şŧ Ĵȧƞŭȧřẏ.

source: Merging rules
es: Ḿḗřɠīƞɠ řŭŀḗş

source: The merging rules can be summarised as follows:
es: Ŧħḗ ḿḗřɠīƞɠ řŭŀḗş ƈȧƞ ƀḗ şŭḿḿȧřīşḗḓ ȧş ƒǿŀŀǿẇş:

source: All releases with the same ```ocid``` should be compiled together, processed by order of the release date, and starting with the oldest first. Compare each pair or releases in turn following the rules below.
es: Ȧŀŀ řḗŀḗȧşḗş ẇīŧħ ŧħḗ şȧḿḗ ```ǿƈīḓ``` şħǿŭŀḓ ƀḗ ƈǿḿƥīŀḗḓ ŧǿɠḗŧħḗř, ƥřǿƈḗşşḗḓ ƀẏ ǿřḓḗř ǿƒ ŧħḗ řḗŀḗȧşḗ ḓȧŧḗ, ȧƞḓ şŧȧřŧīƞɠ ẇīŧħ ŧħḗ ǿŀḓḗşŧ ƒīřşŧ. Ƈǿḿƥȧřḗ ḗȧƈħ ƥȧīř ǿř řḗŀḗȧşḗş īƞ ŧŭřƞ ƒǿŀŀǿẇīƞɠ ŧħḗ řŭŀḗş ƀḗŀǿẇ.

source: For literal values, replace the older value with the newer value. You may remove fields which have been set to null.
es: Ƒǿř ŀīŧḗřȧŀ ṽȧŀŭḗş, řḗƥŀȧƈḗ ŧħḗ ǿŀḓḗř ṽȧŀŭḗ ẇīŧħ ŧħḗ ƞḗẇḗř ṽȧŀŭḗ. Ẏǿŭ ḿȧẏ řḗḿǿṽḗ ƒīḗŀḓş ẇħīƈħ ħȧṽḗ ƀḗḗƞ şḗŧ ŧǿ ƞŭŀŀ.

source: For an array of objects, merge the array by the id of each object EXCEPT as noted in 4.
es: Ƒǿř ȧƞ ȧřřȧẏ ǿƒ ǿƀĵḗƈŧş, ḿḗřɠḗ ŧħḗ ȧřřȧẏ ƀẏ ŧħḗ īḓ ǿƒ ḗȧƈħ ǿƀĵḗƈŧ ḖẊƇḖƤŦ ȧş ƞǿŧḗḓ īƞ 4.

source: For the following arrays, replace the entire array in the older release with the entire array from the newer release
es: Ƒǿř ŧħḗ ƒǿŀŀǿẇīƞɠ ȧřřȧẏş, řḗƥŀȧƈḗ ŧħḗ ḗƞŧīřḗ ȧřřȧẏ īƞ ŧħḗ ǿŀḓḗř řḗŀḗȧşḗ ẇīŧħ ŧħḗ ḗƞŧīřḗ ȧřřȧẏ ƒřǿḿ ŧħḗ ƞḗẇḗř řḗŀḗȧşḗ

source: ```award.suppliers```
es: ```ȧẇȧřḓ.şŭƥƥŀīḗřş```

source: ```organization.additionalIdentifiers```
es: ```ǿřɠȧƞīzȧŧīǿƞ.ȧḓḓīŧīǿƞȧŀĪḓḗƞŧīƒīḗřş```

source: ```item.additionalClassifications```
es: ```īŧḗḿ.ȧḓḓīŧīǿƞȧŀƇŀȧşşīƒīƈȧŧīǿƞş```

source: ```amendment.changes```
es: ```ȧḿḗƞḓḿḗƞŧ.ƈħȧƞɠḗş```

source: Note that this means releases must republish these arrays in full.
es: Ƞǿŧḗ ŧħȧŧ ŧħīş ḿḗȧƞş řḗŀḗȧşḗş ḿŭşŧ řḗƥŭƀŀīşħ ŧħḗşḗ ȧřřȧẏş īƞ ƒŭŀŀ.

source: When all releases are merged, remove the ```release.id``` and ```release.date``` from the resulting data structure, and add ```compiled``` to the list of ```release.tag``` values.
es: Ẇħḗƞ ȧŀŀ řḗŀḗȧşḗş ȧřḗ ḿḗřɠḗḓ, řḗḿǿṽḗ ŧħḗ ```řḗŀḗȧşḗ.īḓ``` ȧƞḓ ```řḗŀḗȧşḗ.ḓȧŧḗ``` ƒřǿḿ ŧħḗ řḗşŭŀŧīƞɠ ḓȧŧȧ şŧřŭƈŧŭřḗ, ȧƞḓ ȧḓḓ ```ƈǿḿƥīŀḗḓ``` ŧǿ ŧħḗ ŀīşŧ ǿƒ ```řḗŀḗȧşḗ.ŧȧɠ``` ṽȧŀŭḗş.

source: A reference implementation of the merge routine in python [is available on GitHub](https://github.com/open-contracting/ocds-merge).
es: Ȧ řḗƒḗřḗƞƈḗ īḿƥŀḗḿḗƞŧȧŧīǿƞ ǿƒ ŧħḗ ḿḗřɠḗ řǿŭŧīƞḗ īƞ ƥẏŧħǿƞ [īş ȧṽȧīŀȧƀŀḗ ǿƞ ƓīŧĦŭƀ](https://github.com/open-contracting/ocds-merge).

source: Requirements for merging
es: Řḗɋŭīřḗḿḗƞŧş ƒǿř ḿḗřɠīƞɠ

source: For merging to work effectively, all the releases to be merged must share a common ```ocid``` and a number of other criteria must be met.
es: Ƒǿř ḿḗřɠīƞɠ ŧǿ ẇǿřķ ḗƒƒḗƈŧīṽḗŀẏ, ȧŀŀ ŧħḗ řḗŀḗȧşḗş ŧǿ ƀḗ ḿḗřɠḗḓ ḿŭşŧ şħȧřḗ ȧ ƈǿḿḿǿƞ ```ǿƈīḓ``` ȧƞḓ ȧ ƞŭḿƀḗř ǿƒ ǿŧħḗř ƈřīŧḗřīȧ ḿŭşŧ ƀḗ ḿḗŧ.

source: The following all require unique identifiers (at least unique within that ocid):
es: Ŧħḗ ƒǿŀŀǿẇīƞɠ ȧŀŀ řḗɋŭīřḗ ŭƞīɋŭḗ īḓḗƞŧīƒīḗřş (ȧŧ ŀḗȧşŧ ŭƞīɋŭḗ ẇīŧħīƞ ŧħȧŧ ǿƈīḓ):

source: awards
es: ȧẇȧřḓş

source: contracts
es: ƈǿƞŧřȧƈŧş

source: items
es: īŧḗḿş

source: documents
es: ḓǿƈŭḿḗƞŧş

source: transactions
es: ŧřȧƞşȧƈŧīǿƞş

source: milestones
es: ḿīŀḗşŧǿƞḗş

source: The following arrays of items must be re-published in full for each release:
es: Ŧħḗ ƒǿŀŀǿẇīƞɠ ȧřřȧẏş ǿƒ īŧḗḿş ḿŭşŧ ƀḗ řḗ-ƥŭƀŀīşħḗḓ īƞ ƒŭŀŀ ƒǿř ḗȧƈħ řḗŀḗȧşḗ:

source: Award.suppliers
es: Ȧẇȧřḓ.şŭƥƥŀīḗřş

source: Organization.additionalIdentifiers
es: Ǿřɠȧƞīzȧŧīǿƞ.ȧḓḓīŧīǿƞȧŀĪḓḗƞŧīƒīḗřş

source: Item.additionalClassifications
es: Īŧḗḿ.ȧḓḓīŧīǿƞȧŀƇŀȧşşīƒīƈȧŧīǿƞş

source: Amendment.changes
es: Ȧḿḗƞḓḿḗƞŧ.ƈħȧƞɠḗş

source: Other lists with ```.id``` properties do not need to be republished in full, but publishers should note the [guidance on emptying fields and values](../../reference/#emptying-fields-and-values).
es: Ǿŧħḗř ŀīşŧş ẇīŧħ ```.īḓ``` ƥřǿƥḗřŧīḗş ḓǿ ƞǿŧ ƞḗḗḓ ŧǿ ƀḗ řḗƥŭƀŀīşħḗḓ īƞ ƒŭŀŀ, ƀŭŧ ƥŭƀŀīşħḗřş şħǿŭŀḓ ƞǿŧḗ ŧħḗ [ɠŭīḓȧƞƈḗ ǿƞ ḗḿƥŧẏīƞɠ ƒīḗŀḓş ȧƞḓ ṽȧŀŭḗş](../../reference/#emptying-fields-and-values).

source: Versioned data
es: Ṽḗřşīǿƞḗḓ ḓȧŧȧ

source: There are some situations in which it is important to be able to see how data about a contracting process has changed over time. For example, to identify how contract values have altered, or milestones moved through stages of implementation.
es: Ŧħḗřḗ ȧřḗ şǿḿḗ şīŧŭȧŧīǿƞş īƞ ẇħīƈħ īŧ īş īḿƥǿřŧȧƞŧ ŧǿ ƀḗ ȧƀŀḗ ŧǿ şḗḗ ħǿẇ ḓȧŧȧ ȧƀǿŭŧ ȧ ƈǿƞŧřȧƈŧīƞɠ ƥřǿƈḗşş ħȧş ƈħȧƞɠḗḓ ǿṽḗř ŧīḿḗ. Ƒǿř ḗẋȧḿƥŀḗ, ŧǿ īḓḗƞŧīƒẏ ħǿẇ ƈǿƞŧřȧƈŧ ṽȧŀŭḗş ħȧṽḗ ȧŀŧḗřḗḓ, ǿř ḿīŀḗşŧǿƞḗş ḿǿṽḗḓ ŧħřǿŭɠħ şŧȧɠḗş ǿƒ īḿƥŀḗḿḗƞŧȧŧīǿƞ.

source: The versioned release schema provides a model for representing this data.
es: Ŧħḗ ṽḗřşīǿƞḗḓ řḗŀḗȧşḗ şƈħḗḿȧ ƥřǿṽīḓḗş ȧ ḿǿḓḗŀ ƒǿř řḗƥřḗşḗƞŧīƞɠ ŧħīş ḓȧŧȧ.

source: In a versioned release, instead of over-writing past values when combining multiple releases, each field becomes an array of objects, indicating the:
es: Īƞ ȧ ṽḗřşīǿƞḗḓ řḗŀḗȧşḗ, īƞşŧḗȧḓ ǿƒ ǿṽḗř-ẇřīŧīƞɠ ƥȧşŧ ṽȧŀŭḗş ẇħḗƞ ƈǿḿƀīƞīƞɠ ḿŭŀŧīƥŀḗ řḗŀḗȧşḗş, ḗȧƈħ ƒīḗŀḓ ƀḗƈǿḿḗş ȧƞ ȧřřȧẏ ǿƒ ǿƀĵḗƈŧş, īƞḓīƈȧŧīƞɠ ŧħḗ:

source: The date, id and tag of the releases where a field-value pair was first encountered;
es: Ŧħḗ ḓȧŧḗ, īḓ ȧƞḓ ŧȧɠ ǿƒ ŧħḗ řḗŀḗȧşḗş ẇħḗřḗ ȧ ƒīḗŀḓ-ṽȧŀŭḗ ƥȧīř ẇȧş ƒīřşŧ ḗƞƈǿŭƞŧḗřḗḓ;

source: The value of the field-value pair at that point;
es: Ŧħḗ ṽȧŀŭḗ ǿƒ ŧħḗ ƒīḗŀḓ-ṽȧŀŭḗ ƥȧīř ȧŧ ŧħȧŧ ƥǿīƞŧ;

source: As a result, the history of any field can be easily read from the data structure.
es: Ȧş ȧ řḗşŭŀŧ, ŧħḗ ħīşŧǿřẏ ǿƒ ȧƞẏ ƒīḗŀḓ ƈȧƞ ƀḗ ḗȧşīŀẏ řḗȧḓ ƒřǿḿ ŧħḗ ḓȧŧȧ şŧřŭƈŧŭřḗ.

source: Example
es: Ḗẋȧḿƥŀḗ

source: Merge strategies in the schema
es: Ḿḗřɠḗ şŧřȧŧḗɠīḗş īƞ ŧħḗ şƈħḗḿȧ

source: Version 1.0 of the OCDS schema includes a series of ```mergeStrategy``` properties which were designed to indicate how releases should be compiled together. In initial implementation, we have found these can create some confusion, and so propose that future versions will omit all but the essential properties required to indicate the exceptions to the general rule in (4) above.
es: Ṽḗřşīǿƞ 1.0 ǿƒ ŧħḗ ǾƇḒŞ şƈħḗḿȧ īƞƈŀŭḓḗş ȧ şḗřīḗş ǿƒ ```ḿḗřɠḗŞŧřȧŧḗɠẏ``` ƥřǿƥḗřŧīḗş ẇħīƈħ ẇḗřḗ ḓḗşīɠƞḗḓ ŧǿ īƞḓīƈȧŧḗ ħǿẇ řḗŀḗȧşḗş şħǿŭŀḓ ƀḗ ƈǿḿƥīŀḗḓ ŧǿɠḗŧħḗř. Īƞ īƞīŧīȧŀ īḿƥŀḗḿḗƞŧȧŧīǿƞ, ẇḗ ħȧṽḗ ƒǿŭƞḓ ŧħḗşḗ ƈȧƞ ƈřḗȧŧḗ şǿḿḗ ƈǿƞƒŭşīǿƞ, ȧƞḓ şǿ ƥřǿƥǿşḗ ŧħȧŧ ƒŭŧŭřḗ ṽḗřşīǿƞş ẇīŀŀ ǿḿīŧ ȧŀŀ ƀŭŧ ŧħḗ ḗşşḗƞŧīȧŀ ƥřǿƥḗřŧīḗş řḗɋŭīřḗḓ ŧǿ īƞḓīƈȧŧḗ ŧħḗ ḗẋƈḗƥŧīǿƞş ŧǿ ŧħḗ ɠḗƞḗřȧŀ řŭŀḗ īƞ (4) ȧƀǿṽḗ.

source: This information is maintained here for reference.
es: Ŧħīş īƞƒǿřḿȧŧīǿƞ īş ḿȧīƞŧȧīƞḗḓ ħḗřḗ ƒǿř řḗƒḗřḗƞƈḗ.

source: Merge strategy reference
es: Ḿḗřɠḗ şŧřȧŧḗɠẏ řḗƒḗřḗƞƈḗ

source: The purpose of merging releases is to create (a) a snapshot record of the current state of a contracting process; (b) a versioned history of the process.
es: Ŧħḗ ƥŭřƥǿşḗ ǿƒ ḿḗřɠīƞɠ řḗŀḗȧşḗş īş ŧǿ ƈřḗȧŧḗ (ȧ) ȧ şƞȧƥşħǿŧ řḗƈǿřḓ ǿƒ ŧħḗ ƈŭřřḗƞŧ şŧȧŧḗ ǿƒ ȧ ƈǿƞŧřȧƈŧīƞɠ ƥřǿƈḗşş; (ƀ) ȧ ṽḗřşīǿƞḗḓ ħīşŧǿřẏ ǿƒ ŧħḗ ƥřǿƈḗşş.

source: Different sections of the data structure need to be handled differently as releases are merged. For some lists, a new release should overwrite the previous list in fully. For example, if a later release updates the list of suppliers against an award, this new list in full should be taken as the latest authoritative information. For other lists, such as a list of contracts, a release may add a new contract to the list without needing to repeat all the previous contracts, or may amend a single award without repeating all the other awards.
es: Ḓīƒƒḗřḗƞŧ şḗƈŧīǿƞş ǿƒ ŧħḗ ḓȧŧȧ şŧřŭƈŧŭřḗ ƞḗḗḓ ŧǿ ƀḗ ħȧƞḓŀḗḓ ḓīƒƒḗřḗƞŧŀẏ ȧş řḗŀḗȧşḗş ȧřḗ ḿḗřɠḗḓ. Ƒǿř şǿḿḗ ŀīşŧş, ȧ ƞḗẇ řḗŀḗȧşḗ şħǿŭŀḓ ǿṽḗřẇřīŧḗ ŧħḗ ƥřḗṽīǿŭş ŀīşŧ īƞ ƒŭŀŀẏ. Ƒǿř ḗẋȧḿƥŀḗ, īƒ ȧ ŀȧŧḗř řḗŀḗȧşḗ ŭƥḓȧŧḗş ŧħḗ ŀīşŧ ǿƒ şŭƥƥŀīḗřş ȧɠȧīƞşŧ ȧƞ ȧẇȧřḓ, ŧħīş ƞḗẇ ŀīşŧ īƞ ƒŭŀŀ şħǿŭŀḓ ƀḗ ŧȧķḗƞ ȧş ŧħḗ ŀȧŧḗşŧ ȧŭŧħǿřīŧȧŧīṽḗ īƞƒǿřḿȧŧīǿƞ. Ƒǿř ǿŧħḗř ŀīşŧş, şŭƈħ ȧş ȧ ŀīşŧ ǿƒ ƈǿƞŧřȧƈŧş, ȧ řḗŀḗȧşḗ ḿȧẏ ȧḓḓ ȧ ƞḗẇ ƈǿƞŧřȧƈŧ ŧǿ ŧħḗ ŀīşŧ ẇīŧħǿŭŧ ƞḗḗḓīƞɠ ŧǿ řḗƥḗȧŧ ȧŀŀ ŧħḗ ƥřḗṽīǿŭş ƈǿƞŧřȧƈŧş, ǿř ḿȧẏ ȧḿḗƞḓ ȧ şīƞɠŀḗ ȧẇȧřḓ ẇīŧħǿŭŧ řḗƥḗȧŧīƞɠ ȧŀŀ ŧħḗ ǿŧħḗř ȧẇȧřḓş.

source: This leads to a set of mergeStrategies which are included in the full schema.
es: Ŧħīş ŀḗȧḓş ŧǿ ȧ şḗŧ ǿƒ ḿḗřɠḗŞŧřȧŧḗɠīḗş ẇħīƈħ ȧřḗ īƞƈŀŭḓḗḓ īƞ ŧħḗ ƒŭŀŀ şƈħḗḿȧ.

source: The OCDS merging has been based on the open source [jsonmerge library](https://github.com/avian2/jsonmerge), but can be implemented in other software as required.
es: Ŧħḗ ǾƇḒŞ ḿḗřɠīƞɠ ħȧş ƀḗḗƞ ƀȧşḗḓ ǿƞ ŧħḗ ǿƥḗƞ şǿŭřƈḗ [ĵşǿƞḿḗřɠḗ ŀīƀřȧřẏ](https://github.com/avian2/jsonmerge), ƀŭŧ ƈȧƞ ƀḗ īḿƥŀḗḿḗƞŧḗḓ īƞ ǿŧħḗř şǿƒŧẇȧřḗ ȧş řḗɋŭīřḗḓ.

source: Within the OCDS release schema, each field has a mergeStrategy property. This strategy describes how to merge that and child fields.
es: Ẇīŧħīƞ ŧħḗ ǾƇḒŞ řḗŀḗȧşḗ şƈħḗḿȧ, ḗȧƈħ ƒīḗŀḓ ħȧş ȧ ḿḗřɠḗŞŧřȧŧḗɠẏ ƥřǿƥḗřŧẏ. Ŧħīş şŧřȧŧḗɠẏ ḓḗşƈřīƀḗş ħǿẇ ŧǿ ḿḗřɠḗ ŧħȧŧ ȧƞḓ ƈħīŀḓ ƒīḗŀḓş.

source: We inherit the existing merge strategies from [jsonmerge](https://github.com/avian2/jsonmerge#merge-strategies) and add a number of specific strategies for OCDS, which are currently only available in the [OCDS fork of jsonmerge](https://github.com/open-contracting/jsonmerge) and which are described below.
es: Ẇḗ īƞħḗřīŧ ŧħḗ ḗẋīşŧīƞɠ ḿḗřɠḗ şŧřȧŧḗɠīḗş ƒřǿḿ [ĵşǿƞḿḗřɠḗ](https://github.com/avian2/jsonmerge#merge-strategies) ȧƞḓ ȧḓḓ ȧ ƞŭḿƀḗř ǿƒ şƥḗƈīƒīƈ şŧřȧŧḗɠīḗş ƒǿř ǾƇḒŞ, ẇħīƈħ ȧřḗ ƈŭřřḗƞŧŀẏ ǿƞŀẏ ȧṽȧīŀȧƀŀḗ īƞ ŧħḗ [ǾƇḒŞ ƒǿřķ ǿƒ ĵşǿƞḿḗřɠḗ](https://github.com/open-contracting/jsonmerge) ȧƞḓ ẇħīƈħ ȧřḗ ḓḗşƈřīƀḗḓ ƀḗŀǿẇ.

source: ocdsVersion merge strategy
es: ǿƈḓşṼḗřşīǿƞ ḿḗřɠḗ şŧřȧŧḗɠẏ

source: Most fields have the mergeStrategy ocdsVersion. The ocdsVersion strategy has two modes of operation:
es: Ḿǿşŧ ƒīḗŀḓş ħȧṽḗ ŧħḗ ḿḗřɠḗŞŧřȧŧḗɠẏ ǿƈḓşṼḗřşīǿƞ. Ŧħḗ ǿƈḓşṼḗřşīǿƞ şŧřȧŧḗɠẏ ħȧş ŧẇǿ ḿǿḓḗş ǿƒ ǿƥḗřȧŧīǿƞ:

source: when making a compiled record, the field is overridden with the latest value
es: ẇħḗƞ ḿȧķīƞɠ ȧ ƈǿḿƥīŀḗḓ řḗƈǿřḓ, ŧħḗ ƒīḗŀḓ īş ǿṽḗřřīḓḓḗƞ ẇīŧħ ŧħḗ ŀȧŧḗşŧ ṽȧŀŭḗ

source: when making a versioned record, the field history is documented.
es: ẇħḗƞ ḿȧķīƞɠ ȧ ṽḗřşīǿƞḗḓ řḗƈǿřḓ, ŧħḗ ƒīḗŀḓ ħīşŧǿřẏ īş ḓǿƈŭḿḗƞŧḗḓ.

source: ocdsVersion for lists
es: ǿƈḓşṼḗřşīǿƞ ƒǿř ŀīşŧş

source: The ocdsVersion strategy also applies to the following lists:
es: Ŧħḗ ǿƈḓşṼḗřşīǿƞ şŧřȧŧḗɠẏ ȧŀşǿ ȧƥƥŀīḗş ŧǿ ŧħḗ ƒǿŀŀǿẇīƞɠ ŀīşŧş:

source: In this instance the entire list is treated as one single value and any change to any field will result in the whole list being updated and documented as changed.
es: Īƞ ŧħīş īƞşŧȧƞƈḗ ŧħḗ ḗƞŧīřḗ ŀīşŧ īş ŧřḗȧŧḗḓ ȧş ǿƞḗ şīƞɠŀḗ ṽȧŀŭḗ ȧƞḓ ȧƞẏ ƈħȧƞɠḗ ŧǿ ȧƞẏ ƒīḗŀḓ ẇīŀŀ řḗşŭŀŧ īƞ ŧħḗ ẇħǿŀḗ ŀīşŧ ƀḗīƞɠ ŭƥḓȧŧḗḓ ȧƞḓ ḓǿƈŭḿḗƞŧḗḓ ȧş ƈħȧƞɠḗḓ.

source: To keep the versioning as clean as possible, the list of objects should **always be given in the same order** in each release, so as not to mistakenly mark a change when actually only order has shifted.
es: Ŧǿ ķḗḗƥ ŧħḗ ṽḗřşīǿƞīƞɠ ȧş ƈŀḗȧƞ ȧş ƥǿşşīƀŀḗ, ŧħḗ ŀīşŧ ǿƒ ǿƀĵḗƈŧş şħǿŭŀḓ **ȧŀẇȧẏş ƀḗ ɠīṽḗƞ īƞ ŧħḗ şȧḿḗ ǿřḓḗř** īƞ ḗȧƈħ řḗŀḗȧşḗ, şǿ ȧş ƞǿŧ ŧǿ ḿīşŧȧķḗƞŀẏ ḿȧřķ ȧ ƈħȧƞɠḗ ẇħḗƞ ȧƈŧŭȧŀŀẏ ǿƞŀẏ ǿřḓḗř ħȧş şħīƒŧḗḓ.

source: This merging strategy has the advantage of not requiring unique identifiers on every object, but has the downside of requiring every release to publish the whole block of data, not just an incremental change.
es: Ŧħīş ḿḗřɠīƞɠ şŧřȧŧḗɠẏ ħȧş ŧħḗ ȧḓṽȧƞŧȧɠḗ ǿƒ ƞǿŧ řḗɋŭīřīƞɠ ŭƞīɋŭḗ īḓḗƞŧīƒīḗřş ǿƞ ḗṽḗřẏ ǿƀĵḗƈŧ, ƀŭŧ ħȧş ŧħḗ ḓǿẇƞşīḓḗ ǿƒ řḗɋŭīřīƞɠ ḗṽḗřẏ řḗŀḗȧşḗ ŧǿ ƥŭƀŀīşħ ŧħḗ ẇħǿŀḗ ƀŀǿƈķ ǿƒ ḓȧŧȧ, ƞǿŧ ĵŭşŧ ȧƞ īƞƈřḗḿḗƞŧȧŀ ƈħȧƞɠḗ.

source: arrayMergeById merge strategy
es: ȧřřȧẏḾḗřɠḗƁẏĪḓ ḿḗřɠḗ şŧřȧŧḗɠẏ

source: The arrayMergeById applies to the following lists of objects within the release:
es: Ŧħḗ ȧřřȧẏḾḗřɠḗƁẏĪḓ ȧƥƥŀīḗş ŧǿ ŧħḗ ƒǿŀŀǿẇīƞɠ ŀīşŧş ǿƒ ǿƀĵḗƈŧş ẇīŧħīƞ ŧħḗ řḗŀḗȧşḗ:

source: Each of these objects has a required id field on it. When the merge is being performed, the item with the corresponding id is looked up for the before and after versions of the release and the fields are then matched accordingly.
es: Ḗȧƈħ ǿƒ ŧħḗşḗ ǿƀĵḗƈŧş ħȧş ȧ řḗɋŭīřḗḓ īḓ ƒīḗŀḓ ǿƞ īŧ. Ẇħḗƞ ŧħḗ ḿḗřɠḗ īş ƀḗīƞɠ ƥḗřƒǿřḿḗḓ, ŧħḗ īŧḗḿ ẇīŧħ ŧħḗ ƈǿřřḗşƥǿƞḓīƞɠ īḓ īş ŀǿǿķḗḓ ŭƥ ƒǿř ŧħḗ ƀḗƒǿřḗ ȧƞḓ ȧƒŧḗř ṽḗřşīǿƞş ǿƒ ŧħḗ řḗŀḗȧşḗ ȧƞḓ ŧħḗ ƒīḗŀḓş ȧřḗ ŧħḗƞ ḿȧŧƈħḗḓ ȧƈƈǿřḓīƞɠŀẏ.

source: If a given entry is omitted (e.g. there is no information about a particular contract in a subsequent release), then the previous values carry forward.
es: Īƒ ȧ ɠīṽḗƞ ḗƞŧřẏ īş ǿḿīŧŧḗḓ (ḗ.ɠ. ŧħḗřḗ īş ƞǿ īƞƒǿřḿȧŧīǿƞ ȧƀǿŭŧ ȧ ƥȧřŧīƈŭŀȧř ƈǿƞŧřȧƈŧ īƞ ȧ şŭƀşḗɋŭḗƞŧ řḗŀḗȧşḗ), ŧħḗƞ ŧħḗ ƥřḗṽīǿŭş ṽȧŀŭḗş ƈȧřřẏ ƒǿřẇȧřḓ.

source: To remove an entry it would have to have it's field values set to null, as per the [guidance on emptying fields and values](../../reference/#emptying-fields-and-values).
es: Ŧǿ řḗḿǿṽḗ ȧƞ ḗƞŧřẏ īŧ ẇǿŭŀḓ ħȧṽḗ ŧǿ ħȧṽḗ īŧ'ş ƒīḗŀḓ ṽȧŀŭḗş şḗŧ ŧǿ ƞŭŀŀ, ȧş ƥḗř ŧħḗ [ɠŭīḓȧƞƈḗ ǿƞ ḗḿƥŧẏīƞɠ ƒīḗŀḓş ȧƞḓ ṽȧŀŭḗş](../../reference/#emptying-fields-and-values).

source: ocdsOmit merge strategy
es: ǿƈḓşǾḿīŧ ḿḗřɠḗ şŧřȧŧḗɠẏ

source: There are a number of fields marked with the strategy ocdsOmit.
es: Ŧħḗřḗ ȧřḗ ȧ ƞŭḿƀḗř ǿƒ ƒīḗŀḓş ḿȧřķḗḓ ẇīŧħ ŧħḗ şŧřȧŧḗɠẏ ǿƈḓşǾḿīŧ.

source: This strategy returns nothing on merge, because to update the field wouldn't make sense.
es: Ŧħīş şŧřȧŧḗɠẏ řḗŧŭřƞş ƞǿŧħīƞɠ ǿƞ ḿḗřɠḗ, ƀḗƈȧŭşḗ ŧǿ ŭƥḓȧŧḗ ŧħḗ ƒīḗŀḓ ẇǿŭŀḓƞ'ŧ ḿȧķḗ şḗƞşḗ.

source: For example, the field for `tag` should not be updated to the latest version, it should be updated to `compiled` for it to make sense.
es: Ƒǿř ḗẋȧḿƥŀḗ, ŧħḗ ƒīḗŀḓ ƒǿř `ŧȧɠ` şħǿŭŀḓ ƞǿŧ ƀḗ ŭƥḓȧŧḗḓ ŧǿ ŧħḗ ŀȧŧḗşŧ ṽḗřşīǿƞ, īŧ şħǿŭŀḓ ƀḗ ŭƥḓȧŧḗḓ ŧǿ `ƈǿḿƥīŀḗḓ` ƒǿř īŧ ŧǿ ḿȧķḗ şḗƞşḗ.
